import requests
import re
import lxml.html
import sys

send_range = "international"
send_who = ""
send_transit_type = ""
send_type = "packet"
send_category = ""
weight = sys.argv[3]
send_value = ""
send_to = "other"

parcel_countries = {'Иран': 'IR', 'Австрия': 'AT', 'Сен-Пьер и Микелон': 'PM', 'Грузия': 'GE', 'Гана': 'GH', 'Камбоджа': 'KH', 'Турция': 'TR', 'Кирибати': 'KI', 'Великобритания': 'GB', 'Дания': 'DK', 'Армения': 'AM', 'Эфиопия': 'ET', 'Нигер': 'NE', 'Йемен': 'YE', 'Чешская Республика': 'CZ', 'Россия': 'RU', 'Багамы': 'BS', 'Корея, Республика': 'KR', 'Вануату': 'VU', 'Гваделупа': 'GP', 'Куба': 'CU', 'Мальта': 'MT', 'Острова Кайман': 'KY', 'Ангилья': 'AI', 'Кувейт': 'KW', 'Босния и Герцеговина': 'BA', 'Тувалу': 'TV', 'Бонэйр, Синт-Эстатиус и Саба (бывшие Антильские о-ва)': 'BQ', 'Мьянма': 'MM', 'Гвинея': 'GN', 'Самоа': 'WS', 'Науру': 'NR', 'Бутан': 'BT', 'Зимбабве': 'ZW', 'Дем. Республика Конго': 'CD', 'Словакия': 'SK', 'Монголия': 'MN', 'Эритрея': 'ER', 'Кипр': 'CY', 'Мексика': 'MX', 'Алжир': 'DZ', 'Исландия': 'IS', 'Гватемала': 'GT', 'Коморы Конго': 'KM', 'Кения': 'KE', 'Либерия': 'LR', 'Малайзия': 'MY', 'Французская Гвиана': 'GF', 'Болгария': 'BG', 'Саудовская Аравия': 'SA', 'Свазиленд': 'SZ', 'Украина': 'UA', 'Теркс и Кайкос о-ва': 'TC', 'Тристан-да-Кунья': 'SH-TR', 'Канада': 'CA', 'Люксембург': 'LU', 'Хорватия': 'HR', 'Вьетнам': 'VN', 'Гаити': 'HT', 'Тринидад и Тобаго': 'TT', 'Аруба': 'AW', 'Мадагаскар': 'MG', 'Гонконг': 'HK', 'Албания': 'AL', 'Майотта': 'YT', 'США': 'US', 'Танзания': 'TZ', 'Маврикий': 'MU', 'Япония': 'JP', 'Монтсеррат': 'MS', 'Египет': 'EG', 'Палестина': 'PS', 'Бангладеш': 'BD', 'Франция ': 'FR', 'Габон': 'GA', 'Сингапур': 'SG', 'Шри-Ланка': 'LK', 'Афганистан': 'AF', 'Сан-Томе и Принсипи': 'ST', 'Нидерланды': 'NL', 'Колумбия': 'CO', 'Доминика': 'DM', 'Руанда': 'RW', 'Черногория': 'ME', 'Уоллис и Футуна': 'WF', 'Новая Каледония': 'NC', 'Бельгия': 'BE', 'Бенин': 'BJ', 'КНДР': 'KP', 'Мальдивы': 'MV', 'Ангола': 'AO', 'Румыния': 'RO', 'Кюрасао ': 'CW', 'Экваториальная Гвинея': 'GQ', 'Монако ': 'MC', 'Перу': 'PE', 'Папуа - Новая Гвинея': 'PG', 'Узбекистан': 'UZ', 'Венгрия': 'HU', 'Оман': 'OM', 'Камерун': 'CM', None: 'selected', 'Боливия': 'BO', 'Китай ': 'CN', 'Венесуэла': 'VE', 'Уругвай': 'UY', 'Литва': 'LT', 'Антигуа и Барбуда': 'AG', 'Южная Африка': 'ZA', 'Южный Судан': 'SS', 'Македония': 'MK', 'Сент-Китс и Невис': 'KN', 'Коста-Рика': 'CR', 'Макао': 'MO', 'Бруней-Даруссалам': 'BN', 'Индия': 'IN', 'Ямайка': 'JM', 'Сенегал': 'SN', 'Питкэрн': 'PN', 'Центрально-Африканская Республика': 'CF', 'Эстония': 'EE', 'Ботсвана': 'BW', 'Ливан': 'LB', 'Словения': 'SI', 'Таджикистан': 'TJ', 'Чад': 'TD', 'Ватикан ': 'VA', 'Казахстан': 'KZ', 'Тунис': 'TN', 'Мали': 'ML', 'Андорра ': 'AD', 'Ирландия': 'IE', 'Канарские острова': 'ES-CN', "Кот-д'Ивуар": 'CI', 'Намибия': 'NA', 'Греция': 'GR', 'Доминиканская Республика': 'DO', 'Гибралтар': 'GI', 'Виргинские о-ва, Британские': 'VG', 'Буркина-Фасо': 'BF', 'Сен-Мартен ': 'SX', 'Ирак': 'IQ', 'Святая Елена, остров ': 'SH', 'Тоголезская Республика': 'TG', 'Австралия': 'AU', 'Мозамбик': 'MZ', 'Швейцария ': 'CH', 'Италия': 'IT', 'Азербайджан': 'AZ', 'Ливия': 'LY', 'Таиланд': 'TH', 'Катар': 'QA', 'Чили': 'CL', 'Туркменистан': 'TM', 'Лесото': 'LS', 'Израиль': 'IL', 'Конго, Республика': 'CG', 'Испания': 'ES', 'Бермуды': 'BM', 'Финляндия': 'FI', 'Иордания': 'JO', 'Никарагуа': 'NI', 'Бурунди': 'BI', 'Тонга': 'TO', 'Филиппины': 'PH', 'Фарерские острова': 'FO', 'Суринам': 'SR', 'Нигерия': 'NG', 'Тимор-Лесте': 'TL', 'Сирийская Арабская Респ.': 'SY', 'Тайвань ': 'TW', 'Уганда': 'UG', 'Объед.Арабские Эмираты': 'AE', 'Латвия': 'LV', 'Гвинея-Биссау': 'GW', 'Лаос': 'LA', 'Замбия': 'ZM', 'Непал': 'NP', 'Киргизия': 'KG', 'Пакистан': 'PK', 'Аргентина': 'AR', 'Судан': 'SD', 'Гренландия': 'GL', 'Гамбия': 'GM', 'Новая Зеландия': 'NZ', 'Бахрейн': 'BH', 'Мавритания': 'MR', 'Португалия': 'PT', 'Индонезия': 'ID', 'Эквадор': 'EC', 'Сент-Люсия': 'LC', 'Норвегия': 'NO', 'Мартиника': 'MQ', 'Французская Полинезия': 'PF', 'Сомали': 'SO', 'Фиджи': 'FJ', 'Сербия ': 'RS', 'Швеция': 'SE', 'Фолклендские острова ': 'FK', 'Гренада': 'GD', 'Сьерра-Леоне': 'SL', 'Польша': 'PL', 'Кабо Верде о-ва': 'CV', 'Гайана': 'GY', 'Сейшелы': 'SC', 'Белиз': 'BZ', 'Германия': 'DE', 'Сальвадор': 'SV', 'Сент-Винсент и Гренадины': 'VC', 'Лихтенштейн': 'LI', 'Бразилия': 'BR', 'Реюньон': 'RE', 'Молдова': 'MD', 'Парагвай': 'PY', 'Джибути': 'DJ', 'Соломоновы острова': 'SB', 'Марокко': 'MA', 'Панама': 'PA', 'Малави': 'MW', 'Гондурас': 'HN', 'Барбадос': 'BB', 'Россия': 'RU'}

ems_countries = {'Коморы Конго': 'n86', 'Шри-Ланка': 'n192', 'Непал': 'n123', 'Лаос': 'n96', 'Сербия ': 'n157', 'Гватемала': 'n45', 'Никарагуа': 'n126', 'Виргинские о-ва, Британские': 'n33', 'Болгария': 'n21', 'Армения': 'n10', 'Алжир': 'n5', 'Босния и Герцеговина': 'n24', 'Словения': 'n160', 'Гана': 'n44', 'Перу': 'n137', 'Грузия': 'n50', 'Новая Зеландия': 'n127', 'Бенин': 'n19', 'Эстония': 'n196', 'Норвегия': 'n129', 'Нидерланды': 'n122', 'Кабо -Верде': 'n73', 'Марокко': 'n114', 'Израиль': 'n61', 'Гренландия': 'n52', 'Фарерские острова': 'n53', 'Замбия': 'n59', 'Нигерия': 'n125', 'Словакия': 'n159', 'Гренада': 'n48', 'Аргентина': 'n9', 'Канарские острова': 'n70', 'Лихтенштейн': 'n102', 'Малави': 'n109', 'Мальта': 'n113', 'Сент-Китс и Невис': 'n154', 'Суринам': 'n163', 'Великобритания': 'n32', 'Сан -Томе и Принсипи': 'n149', 'Ангилья': 'n6', 'Египет': 'n58', 'Бельгия': 'n18', 'США': 'n164', 'Корея, Республика': 'n88', 'Кипр': 'n80', 'Иордания': 'n64', 'Эквадор': 'n193', 'Финляндия': 'n181', 'Сенегал': 'n153', 'Исландия': 'n68', ' - Санкт-Петербург': 'n143', 'Латвия': 'n97', 'Черногория': 'n187', 'Бахрейн': 'n16', 'Бонэйр, Синт-Эстатиус и Саба': 'n22', 'Индия': 'n62', 'Мальдивы': 'n112', 'Сьерра-Леоне': 'n165', 'Бурунди': 'n29', 'Италия': 'n71', 'Чехия': 'n188', 'Кыргызстан': 'n94', 'Барбадос': 'n15', 'Венгрия': 'n37', 'Португалия': 'n139', 'Тайвань': 'n84', 'Доминика': 'n56', 'Соломоновы острова': 'n161', 'Либерия': 'n99', 'Уганда': 'n175', 'Франция': 'n182', 'Папуа-Новая Гвинея': 'n135', 'Филиппины': 'n180', 'Швеция': 'n191', 'Эфиопия': 'n197', 'Французская Полинезия': 'n183', 'Гибралтар': 'n36', 'Маврикий': 'n104', 'Нигер': 'n124', 'Польша': 'n138', 'Зимбабве': 'n60', 'Уругвай': 'n178', 'Косово': 'n89', 'Хорватия': 'n184', 'Сейшельские острова': 'n152', 'Гернси': 'n34', 'Дем. Республика Конго': 'n54', 'Венесуэла': 'n38', 'Коста-Рика': 'n90', 'Сальвадор': 'n146', 'Ирак': 'n65', 'Дания': 'n51', 'Гвинея': 'n46', 'Оман': 'n131', 'Азербайджан': 'n3', 'Афганистан': 'n12', 'Мали': 'n111', 'Колумбия': 'n85', 'Объед. Арабские Эмираты': 'n130', 'Танзания': 'n168', "Кот-д'Ивуар": 'n91', 'Мьянма': 'n120', 'Албания': 'n4', 'Кувейт': 'n93', 'Китай': 'n82', 'Монголия': 'n119', 'Экваториальная Гвинея': 'n194', 'Багамы': 'n13', 'Фиджи': 'n179', 'Вануату': 'n31', 'Тунис': 'n172', 'Белиз': 'n17', 'Джерси': 'n35', 'Мексика': 'n115', 'Габон': 'n40', 'Макао': 'n107', 'Пакистан': 'n133', 'Эритрея': 'n195', 'Малайзия': 'n110', 'Австралия': 'n1', 'Тайланд': 'n167', 'Ямайка': 'n199', 'Германия': 'n47', 'Буркина-Фасо': 'n28', 'Сент-Люсия, острова': 'n155', 'Ирландия': 'n67', 'Тринидад и Тобаго': 'n171', 'Ливан': 'n100', 'Мадагаскар': 'n106', 'Туркменистан': 'n173', 'Мавритания': 'n105', 'Конго, Республика': 'n87', 'Джибути': 'n55', 'Турция': 'n174', 'Чад': 'n186', 'Кирибати': 'n81', 'Бразилия': 'n26', 'Доминиканская Республика': 'n57', 'Катар': 'n78', ' - Московская область': 'n142', 'Камбоджа': 'n75', 'Саудовская Аравия': 'n150', 'Индонезия': 'n63', 'Самоа': 'n147', 'ЮАР': 'n198', 'Узбекистан': 'n176', 'Камерун': 'n76', 'Свазиленд': 'n151', 'Антигуа и Барбуда': 'n8', 'Люксембург': 'n103', 'Чили': 'n189', 'Таджикистан': 'n166', 'Гамбия': 'n43', 'Острова Кайман': 'n132', 'Швейцария': 'n190', 'Кюрасао': 'n95', 'Теркс и Кайкос': 'n169', 'Лесото': 'n98', ' - Москва': 'n141', 'Кения': 'n79', 'Австрия': 'n2', 'Мозамбик': 'n116', 'Литва': 'n101', 'Монако': 'n118', 'Гайана': 'n42', 'Бруней-Даруссалам': 'n27', 'Сен-Мартен': 'n156', 'Куба': 'n92', 'Судан': 'n162', 'Бангладеш': 'n14', 'Гаити': 'n41', 'Йемен': 'n72', 'Аруба': 'n11', 'Панама': 'n134', 'Бутан': 'n30', 'Испания': 'n69', 'Намибия': 'n121', 'Япония': 'n200', 'Казахстан': 'n74', 'Румыния': 'n145', 'Ботсвана': 'n25', 'Сингапур': 'n158', 'Вьетнам': 'n39', 'Македония': 'n108', 'Руанда': 'n144', 'Гонконг (Кит.)': 'n83', 'Греция': 'n49', 'Парагвай': 'n136', 'Новая Каледония': 'n128', 'Того': 'n170', 'Боливия': 'n23', 'Бермуды': 'n20', 'Иран': 'n66', 'Центр.Африканская Республика': 'n185', 'Украина': 'n177', 'Россия': 'n140', 'Канада': 'n77', 'Ангола': 'n7', 'Молдова': 'n117', 'Сан-Марино': 'n148'}


def getCountries(_from):
    r = requests.get(_from)
    r = lxml.html.fromstring(r.text).xpath("//select[@name='to']/option[string-length(@value) > 0]")
    countries = { }
    for x in r:
        countries[x.text] = x.attrib["value"]
    return countries

def BelRubToRubRate():
    return 0.0035

def cleanTextAndPrintPrice(text):
    print( float("".join(filter(lambda x: x.isdigit(), text))) *BelRubToRubRate())

def sendRequestAndGetPrice(url, type, to, weight, declared="", who="fiz", priority="priority"):
        payload = { "who":who, #вроде не важно
            "priority":priority,
            "type":type,
            "to":to,
            "weight":str(weight),
            "declared":declared
            }
        r = requests.post(url, data=payload)
        #print(r.text)
        r = re.search('\\d+ руб.', r.text)
        if r:
            cleanTextAndPrintPrice(r.group())

def getPrices(send_range, send_type, weight, send_to):
    url = "http://tarifikator.belpost.by/forms/"
    if send_range == 'internal':
        url += 'internal'
    else:
        url += 'international'

    url += '/' + send_type + ".php"
    if send_type == "small" or send_type == "packet" or send_type == "letter":
        sendRequestAndGetPrice(url, type="simple", to="other", weight= int(weight)*1000)
        sendRequestAndGetPrice(url, type="registered", to="other", weight= int(weight)*1000)
    elif send_type == "parcel":
        try:
            send_to = parcel_countries[send_to]
            sendRequestAndGetPrice(url, priority="no", type="simple", to=send_to, weight=weight)
            sendRequestAndGetPrice(url, priority="yes", type="simple", to=send_to, weight=weight)
            sendRequestAndGetPrice(url, priority="no", type="registered", to=send_to, weight=weight)
            sendRequestAndGetPrice(url, priority="yes", type="registered", to=send_to, weight=weight)
        except Exception as e:
            pass
    else:
        send_to = ems_countries[send_to]
        sendRequestAndGetPrice(url, priority="", type="docs", to=send_to, weight=weight)
        sendRequestAndGetPrice(url, priority="", type="goods", to=send_to, weight=weight)
        
        
        
getPrices('international', 'letter', weight, 'Россия')
getPrices('international', 'packet', weight, 'Россия')
getPrices('international', 'small', weight, 'Россия')
getPrices('international', 'parcel', weight, 'Россия')
getPrices('international', 'ems', weight, 'Россия')